#include "oasis_match.h"
#include <iostream>
#include <algorithm>
#include "../tutil/tc_common.h"

/**
 * factor配置
 * */
#define OasisWar_Match_Dan 50
#define OasisWar_Match_Power 10000
#define OasisWar_Match_Win 1000
#define OasisWar_Match_Lose 2000
#define OasisWar_Match_MaxWinLose 5000

/**
 * 军团x：备注
 * 联盟uid: 100开头, 数据相同即为同一联盟
 * 战力: 军团战力
 * 区服: 所属哪个服
 * 军团uid：200开头, 必须不同
 * 段位: 军团所在段位
 * 段位分: 军团的段位分
 * 连胜场数：x 指定连胜场次时，连败场次必须为0
 * 连败场数：x 指定连败场次时，连胜场次必须为0
 * 上次匹配军团uid：上次匹配的是哪个军团可以为0
 * 报名时间段: 报名时间段，相同时间段的军团会匹配在一起
 * */
static map<string, string> legionConfig = {
        make_pair("军团1_Sos", "联盟uid:1519730216132420608;战力:27838892;区服:36;军团uid:5143380708689006592;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团2_BOR", "联盟uid:1149840867406644224;战力:518774416;区服:4;军团uid:5143386568920223744;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团3_TFN", "联盟uid:1495745557077958912;战力:49440242;区服:33;军团uid:5143369347443511296;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团4_GoL", "联盟uid:1471621942225148416;战力:266905656;区服:26;军团uid:5143372547898822656;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团5_GoL", "联盟uid:1471621942225148416;战力:173963520;区服:26;军团uid:5143372547898822657;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团6_OBX", "联盟uid:1501641758478443008;战力:165536669;区服:34;军团uid:5143369474161856512;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团7_OBX", "联盟uid:1501641758478443008;战力:125845860;区服:34;军团uid:5143369474161856513;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团8_Ody", "联盟uid:1519337780860167168;战力:37120282;区服:36;军团uid:5143376262793875456;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团9_Ody", "联盟uid:1519337780860167168;战力:24423031;区服:36;军团uid:5143376262793875457;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团10_DlM", "联盟uid:1521460339571434496;战力:18411283;区服:36;军团uid:5143390991008485376;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团11_DTS", "联盟uid:1475542346782219264;战力:191076716;区服:28;军团uid:5143366037416267776;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团12_DTS", "联盟uid:1475542346782219264;战力:143612941;区服:28;军团uid:5143366037416267777;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团13_RED", "联盟uid:1488589075186196480;战力:162884259;区服:32;军团uid:5143341647169409024;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团14_RED", "联盟uid:1488589075186196480;战力:116235413;区服:32;军团uid:5143341647169409025;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团15_jpg", "联盟uid:1505661148995789312;战力:24282611;区服:34;军团uid:5143374398459301888;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团16_CRW", "联盟uid:1436405695472735488;战力:313643348;区服:21;军团uid:5143369901829836801;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团17_SW7", "联盟uid:1395388902348427776;战力:81989283;区服:18;军团uid:5143376566461485056;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团18_ToT", "联盟uid:1458264448140580864;战力:174109331;区服:24;军团uid:5143369171115003904;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团19_RWS", "联盟uid:1519034466243191808;战力:88519142;区服:36;军团uid:5143371219797626880;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团20_RWS", "联盟uid:1519034466243191808;战力:67628096;区服:36;军团uid:5143371219797626881;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团21_BEO", "联盟uid:1482139410039315968;战力:125445294;区服:30;军团uid:5143379456001396736;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团22_BRA", "联盟uid:1487556574695137280;战力:111524860;区服:32;军团uid:5143339221905395712;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团23_BRA", "联盟uid:1487556574695137280;战力:96530662;区服:32;军团uid:5143339221905395713;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团24_Re2", "联盟uid:1488283671050854400;战力:113376403;区服:32;军团uid:5143374137154162688;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团25_ERO", "联盟uid:1471938591876717312;战力:26208162;区服:27;军团uid:5143410874207227904;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团26_END", "联盟uid:1476294700028664832;战力:157323836;区服:28;军团uid:5143380428358504448;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团27_END", "联盟uid:1476294700028664832;战力:82062305;区服:28;军团uid:5143380428358504449;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团28_LST", "联盟uid:1501885906095710720;战力:54329061;区服:34;军团uid:5143377447902859264;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团29_VNM", "联盟uid:1450894654315697920;战力:136919799;区服:23;军团uid:5143377859179499520;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团30_VNM", "联盟uid:1450894654315697920;战力:110632402;区服:23;军团uid:5143377859179499521;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团31_ATL", "联盟uid:1463943104833788160;战力:193510916;区服:25;军团uid:5143377875369512960;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团32_ATL", "联盟uid:1463943104833788160;战力:194319150;区服:25;军团uid:5143377875369512961;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团33_BIG", "联盟uid:1472367911724129024;战力:165871094;区服:27;军团uid:5143377691575111680;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团34_BIG", "联盟uid:1472367911724129024;战力:125181761;区服:27;军团uid:5143377691575111681;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团35_TCG", "联盟uid:1473740576191945472;战力:133139047;区服:27;军团uid:5143370485693730816;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团36_TCG", "联盟uid:1473740576191945472;战力:60760992;区服:27;军团uid:5143370485693730817;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团37_340", "联盟uid:1481976247956282624;战力:101969063;区服:29;军团uid:5143371824465235968;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团38_OMN", "联盟uid:1483268769324211968;战力:209565148;区服:31;军团uid:5143366033423257600;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团39_300", "联盟uid:1481335816021089536;战力:243194147;区服:29;军团uid:5143370470711676928;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团40_300", "联盟uid:1481335816021089536;战力:184240902;区服:29;军团uid:5143370470711676929;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团41_RED", "联盟uid:1507456933257290496;战力:113537658;区服:35;军团uid:5143337612869685248;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团42_RED", "联盟uid:1507456933257290496;战力:101047415;区服:35;军团uid:5143337612869685249;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团43_KDA", "联盟uid:1467020929853823232;战力:191559295;区服:25;军团uid:5143379935729078272;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团44_KDA", "联盟uid:1467020929853823232;战力:124795871;区服:25;军团uid:5143379935729078273;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团45_320", "联盟uid:1481550293047975168;战力:182971201;区服:29;军团uid:5143371955361075200;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团46_320", "联盟uid:1481550293047975168;战力:138455533;区服:29;军团uid:5143371955361075201;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团47_zip", "联盟uid:1514330512196379392;战力:22536003;区服:35;军团uid:5143394944307744768;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团48_CRZ", "联盟uid:1529334536100386048;战力:43429386;区服:21;军团uid:5143384836236431361;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团49_SZ1", "联盟uid:1074564123456438784;战力:427795502;区服:2;军团uid:5143398763271901184;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团50_INA", "联盟uid:1110679822780072960;战力:564185813;区服:4;军团uid:5143381658698862592;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团51_INA", "联盟uid:1110679822780072960;战力:234513432;区服:4;军团uid:5143381658698862593;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团52_DNA", "联盟uid:1223473289200929280;战力:707652435;区服:10;军团uid:5143334974216294400;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团53_DNA", "联盟uid:1223473289200929280;战力:376971719;区服:10;军团uid:5143334974216294401;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团54_PDS", "联盟uid:1314843940926524928;战力:530586696;区服:14;军团uid:5143375298103955456;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团55_PDS", "联盟uid:1314843940926524928;战力:307317556;区服:14;军团uid:5143375298103955457;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团56_NO1", "联盟uid:1426259806955508736;战力:277935236;区服:20;军团uid:5143383601836019712;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团57_NO1", "联盟uid:1426259806955508736;战力:141945616;区服:20;军团uid:5143383601836019713;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团58_RSS", "联盟uid:1426368162890257408;战力:138030012;区服:20;军团uid:5143385411762081792;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团59_RSS", "联盟uid:1426368162890257408;战力:119384403;区服:20;军团uid:5143385411762081793;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团60_Aut", "联盟uid:1428244221130707968;战力:236035866;区服:20;军团uid:5143383217084125184;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团61_Aut", "联盟uid:1428244221130707968;战力:126971164;区服:20;军团uid:5143383217084125185;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团62_INA", "联盟uid:1443898584167618048;战力:195826808;区服:22;军团uid:5143394138514870272;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团63_INA", "联盟uid:1443898584167618048;战力:122462122;区服:22;军团uid:5143394138514870273;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团64_Bel", "联盟uid:1444162211961378304;战力:251106655;区服:22;军团uid:5143378216785891328;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团65_RE1", "联盟uid:1458147146795587584;战力:236102427;区服:24;军团uid:5143372057299472384;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团66_RE1", "联盟uid:1458147146795587584;战力:119135642;区服:24;军团uid:5143372057299472385;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团67_FFb", "联盟uid:1469734138457102848;战力:186558355;区服:26;军团uid:5143369206884028416;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团68_FFb", "联盟uid:1469734138457102848;战力:154949837;区服:26;军团uid:5143369206884028417;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团69_GoS", "联盟uid:1471483890769074688;战力:223606037;区服:26;军团uid:5143369459028807680;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团70_GoS", "联盟uid:1471483890769074688;战力:180980248;区服:26;军团uid:5143369459028807681;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团71_Ger", "联盟uid:1471601296904559104;战力:175702213;区服:26;军团uid:5143370545907191808;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团72_Ger", "联盟uid:1471601296904559104;战力:120138556;区服:26;军团uid:5143370545907191809;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团73_GOP", "联盟uid:1471967710630910464;战力:177452011;区服:26;军团uid:5143373268664799232;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团74_GOP", "联盟uid:1471967710630910464;战力:117507576;区服:26;军团uid:5143373268664799233;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团75_ONE", "联盟uid:1482225190485106176;战力:219276132;区服:30;军团uid:5143372784658894848;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团76_ONE", "联盟uid:1482225190485106176;战力:123168532;区服:30;军团uid:5143372784658894849;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团77_KDA", "联盟uid:1482334104010628608;战力:65238218;区服:30;军团uid:5143384620078813184;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团78_KDA", "联盟uid:1482334104010628608;战力:24140575;区服:30;军团uid:5143384620078813185;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团79_Sea", "联盟uid:1482352859847597568;战力:109509093;区服:30;军团uid:5143384858902482944;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团80_Sea", "联盟uid:1482352859847597568;战力:70344832;区服:30;军团uid:5143384858902482945;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团81_AAY", "联盟uid:1482515179278179328;战力:82024029;区服:28;军团uid:5143372135414190080;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团82_SSS", "联盟uid:1489546688627482624;战力:79473956;区服:32;军团uid:5143382371244003328;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团83_APO", "联盟uid:1491941318769778688;战力:74751849;区服:32;军团uid:5143379162299453440;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团84_GWS", "联盟uid:1501627033552167424;战力:147735507;区服:34;军团uid:5143369594370609152;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团85_GWS", "联盟uid:1501627033552167424;战力:93077186;区服:34;军团uid:5143369594370609153;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团86_WOS", "联盟uid:1502206309162820096;战力:91444620;区服:34;军团uid:5143368893452079104;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团87_QOA", "联盟uid:1502441894980887040;战力:132881195;区服:34;军团uid:5143369615476346880;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团88_QOA", "联盟uid:1502441894980887040;战力:85736894;区服:34;军团uid:5143369615476346881;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团89_KOS", "联盟uid:1519028033086825472;战力:72192431;区服:36;军团uid:5143329366465400832;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团90_KOS", "联盟uid:1519028033086825472;战力:50281319;区服:36;军团uid:5143329366465400833;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团91_Gre", "联盟uid:1519033363627779072;战力:64397926;区服:36;军团uid:5143382982874189824;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团92_PfY", "联盟uid:1461980136353044480;战力:81713494;区服:24;军团uid:5143444918231977984;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团93_KLA", "联盟uid:1450932199393072896;战力:201587329;区服:23;军团uid:5143376350102474752;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团94_KLA", "联盟uid:1450932199393072896;战力:193323451;区服:23;军团uid:5143376350102474753;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团95_LGN", "联盟uid:1471860687595641600;战力:183996317;区服:27;军团uid:5143381972600541184;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团96_FRQ", "联盟uid:1485275958050037504;战力:54385541;区服:31;军团uid:5143379603372429312;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团97_PAR", "联盟uid:1494530043433459968;战力:107114313;区服:33;军团uid:5143379306365374464;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团98_El4", "联盟uid:1508437979603936000;战力:72550728;区服:35;军团uid:5143369210591760384;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团99_DRT", "联盟uid:1479254322884647936;战力:74815443;区服:28;军团uid:5143374540478435328;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团100_RUS", "联盟uid:1173735321527912192;战力:352846322;区服:7;军团uid:5143387096815292416;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团101_IEA", "联盟uid:1111309053373449216;战力:364194831;区服:4;军团uid:5143369605510680576;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团102_IEA", "联盟uid:1111309053373449216;战力:359939587;区服:4;军团uid:5143369605510680577;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团103_RTX", "联盟uid:1492125430948306944;战力:53305753;区服:32;军团uid:5143377230470139904;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团104_w8w", "联盟uid:1264535477629750272;战力:338097780;区服:12;军团uid:5143407788139040768;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团105_GRW", "联盟uid:1072699987944538368;战力:816338005;区服:1;军团uid:5143337403875905536;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团106_GRW", "联盟uid:1072699987944538368;战力:242578694;区服:1;军团uid:5143337403875905537;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团107_BRA", "联盟uid:1306192691633065216;战力:282458443;区服:13;军团uid:5143417953991053312;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团108_BLD", "联盟uid:1335282687782424320;战力:306912664;区服:15;军团uid:5143374943014146048;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团109_BLD", "联盟uid:1335282687782424320;战力:229983667;区服:15;军团uid:5143374943014146049;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团110_BIG", "联盟uid:1370343104682397952;战力:223786123;区服:17;军团uid:5143388074155233280;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团111_BIG", "联盟uid:1370343104682397952;战力:108973643;区服:17;军团uid:5143388074155233281;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团112_TBG", "联盟uid:1419165927869518592;战力:302919509;区服:19;军团uid:5143322375399460864;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团113_TBG", "联盟uid:1419165927869518592;战力:171213661;区服:19;军团uid:5143322375399460865;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团114_TSS", "联盟uid:1436415356548683008;战力:201331321;区服:21;军团uid:5143373187161051136;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团115_TSS", "联盟uid:1436415356548683008;战力:91247992;区服:21;军团uid:5143373187161051137;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团116_PHL", "联盟uid:1438668188983235840;战力:203315427;区服:21;军团uid:5143391867248889856;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团117_PHL", "联盟uid:1438668188983235840;战力:191873356;区服:21;军团uid:5143391867248889857;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团118_WOW", "联盟uid:1452859239163762432;战力:96644274;区服:23;军团uid:5143376717271846912;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团119_UTS", "联盟uid:1468437530109024512;战力:87192064;区服:25;军团uid:5143383524006481920;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团120_GOD", "联盟uid:1471758498260851456;战力:189513678;区服:27;军团uid:5143372614856658944;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团121_GOD", "联盟uid:1471758498260851456;战力:148432180;区服:27;军团uid:5143372614856658945;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团122_310", "联盟uid:1481346016702635264;战力:142637433;区服:29;军团uid:5143338222822150144;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团123_310", "联盟uid:1481346016702635264;战力:116067502;区服:29;军团uid:5143338222822150145;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团124_333", "联盟uid:1481543818518994176;战力:117700304;区服:29;军团uid:5143373878902444032;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团125_333", "联盟uid:1481543818518994176;战力:81089319;区服:29;军团uid:5143373878902444033;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团126_EMP", "联盟uid:1482005940944248064;战力:33318976;区服:29;军团uid:5143372017168338944;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团127_POL", "联盟uid:1483676302295703296;战力:108178385;区服:31;军团uid:5143369903859879936;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团128_POL", "联盟uid:1483676302295703296;战力:81061959;区服:31;军团uid:5143369903859879937;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团129_MYA", "联盟uid:1486499340745711360;战力:79833670;区服:31;军团uid:5143377827957100544;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团130_FLY", "联盟uid:1494529478158721280;战力:130343478;区服:33;军团uid:5143339300171075584;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团131_FLY", "联盟uid:1494529478158721280;战力:114824369;区服:33;军团uid:5143339300171075585;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团132_DIE", "联盟uid:1494682767521227008;战力:117107233;区服:33;军团uid:5143379879357632512;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团133_McR", "联盟uid:1494750620890964224;战力:83259239;区服:33;军团uid:5143381447222022144;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团134_NKA", "联盟uid:1499717014350995712;战力:83312483;区服:33;军团uid:5143369542663196672;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团135_WWD", "联盟uid:1507432299690468096;战力:62841015;区服:35;军团uid:5143339421369683968;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团136_WWD", "联盟uid:1507432299690468096;战力:40969170;区服:35;军团uid:5143339421369683969;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团137_J4F", "联盟uid:1508235423158117120;战力:67876836;区服:35;军团uid:5143370001838821376;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团138_J4F", "联盟uid:1508235423158117120;战力:44652325;区服:35;军团uid:5143370001838821377;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团139_H8c", "联盟uid:1510065992946950912;战力:31503708;区服:35;军团uid:5143381006216122368;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团140_RD2", "联盟uid:1512183568741180160;战力:38437749;区服:35;军团uid:5143381858733576192;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团141_MoP", "联盟uid:1513770452638507776;战力:93063482;区服:35;军团uid:5143374444126851072;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团142_MoP", "联盟uid:1513770452638507776;战力:61130030;区服:35;军团uid:5143374444126851073;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团143_BRO", "联盟uid:1485036109460150016;战力:46969814;区服:23;军团uid:5143408662231961600;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团144_RpS", "联盟uid:1483887911240736512;战力:12029430;区服:31;军团uid:5143423352613949440;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团145_DIE", "联盟uid:1094607267233268480;战力:66349073;区服:3;军团uid:5143577880453763072;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团146_gSK", "联盟uid:1497330615194755328;战力:26423461;区服:33;军团uid:5143411675688390656;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团147_g0s", "联盟uid:1471492631346289152;战力:25590052;区服:26;军团uid:5143383310197673984;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团148_LTF", "联盟uid:1421128222023619328;战力:203979892;区服:19;军团uid:5143395530319122432;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团149_LTF", "联盟uid:1421128222023619328;战力:43120501;区服:19;军团uid:5143395530319122433;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团150_FTL", "联盟uid:1485041594586373888;战力:107218637;区服:31;军团uid:5143404688816787456;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团151_FTL", "联盟uid:1485041594586373888;战力:56566267;区服:31;军团uid:5143404688816787457;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:1"),
        make_pair("军团152_TNO", "联盟uid:1472201304121023232;战力:97939475;区服:27;军团uid:5143374252010950656;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团153_TNO", "联盟uid:1472201304121023232;战力:59710809;区服:27;军团uid:5143374252010950657;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团154_THK", "联盟uid:1135298074671842560;战力:710480102;区服:5;军团uid:5143376894657351680;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团155_THK", "联盟uid:1135298074671842560;战力:210589591;区服:5;军团uid:5143376894657351681;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团156_3NT", "联盟uid:1154193318393939456;战力:63350488;区服:6;军团uid:5143566331890716672;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团157_KOW", "联盟uid:1223711609604540928;战力:470721041;区服:10;军团uid:5143386611014258688;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团158_WoU", "联盟uid:1072673006356005120;战力:161001503;区服:1;军团uid:5143394704041234432;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团159_PhX", "联盟uid:1355428864536350720;战力:129637477;区服:16;军团uid:5143417429333987328;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团160_OTP", "联盟uid:1475900194783501312;战力:57512398;区服:28;军团uid:5143380707044839424;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
        make_pair("军团161_Cud", "联盟uid:1501870270317601280;战力:39679780;区服:34;军团uid:5143393621424295936;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:2"),
        make_pair("军团162_HoS", "联盟uid:1481882900851858688;战力:62790649;区服:29;军团uid:5143374063888027648;段位:0;段位分:0;连胜场数:0;连败场数:0;上次匹配军团uid:0;报名时间段:3"),
};

////////////////////////////////// 代码区域 ///////////////////////////////////////////////
int64_t stringToInt(const string &str) {
    try {
        int result = std::stoi(str);
        return result;
    } catch (const std::invalid_argument& e) {
        std::cout << "Error: The string \"" << str << "\" cannot be converted to an integer." << std::endl;
    } catch (const std::out_of_range& e) {
        std::cout << "Error: The string \"" << str << "\" is out of the integer range." << std::endl;
    }
    return 0;
}

vector<string> sepstr(const string &sStr, const string &sSep, bool withEmpty = false)
{
    vector<string> vt;

    string::size_type pos = 0;
    string::size_type pos1 = 0;

    while (true) {
        string s;
        pos1 = sStr.find_first_of(sSep, pos);
        if (pos1 == string::npos) {
            if (pos + 1 <= sStr.length()) {
                s = sStr.substr(pos);
            }
        }
        else if (pos1 == pos) {
            s = "";
        }
        else {
            s = sStr.substr(pos, pos1 - pos);
            pos = pos1;
        }

        if (withEmpty) {
            vt.push_back(std::move(s));
        }
        else {
            if (!s.empty()) {
                vt.push_back(std::move(s));
            }
        }

        if (pos1 == string::npos) {
            break;
        }

        pos++;
    }

    return vt;
}

int64_t strtoint64(const string &str) {
    return tars::TC_Common::strto<int64_t>(str);
}

void oasis_match::loadConfig() {
    for (const auto &info : legionConfig) {
        struct OwActLegionInfo legion;
        auto strs = sepstr(info.second, ";");
        if (strs.size() != 10) {
            std::cout << "解析 " << info.first << " 错误1，请检查配置" << std::endl;
            exit(-1);
        }
        for (const auto &str : strs) {
            auto lstr = sepstr(str, ":");
            if (lstr.size() != 2) {
                std::cout << "解析 " << info.first << " 错误2，请检查配置" << std::endl;
                exit(-1);
            }
            if (lstr.at(0) == "联盟uid") {
                legion.luid = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "战力") {
                legion.power = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "区服") {
                legion.server = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "军团uid") {
                legion.legUid = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "段位") {
                legion.danId = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "段位分") {
                legion.danScore = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "连胜场数") {
                legion.winStreak = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "连败场数") {
                legion.loseStreak = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "上次匹配军团uid") {
                legion.lastMatchUid = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "报名时间段") {
                legion.signUpIndex = strtoint64(lstr.at(1));
            } else if (lstr.at(0) == "联盟名字") {
                legion.leagueName = lstr.at(1);
            } else if (lstr.at(0) == "第几军团") {
                legion.sid = strtoint64(lstr.at(1));
            }
        }
        data.legions[legion.legUid] = legion;
    }
}

void oasis_match::startMatch() {
    auto mmrs = calcMmrs();
    map<int64_t, vector<pair<int64_t, int64_t>>> matchs;
    for (const auto &legion : data.legions) {
        matchs[legion.second.signUpIndex].push_back(make_pair(legion.first, mmrs[legion.first]));
    }
    for (auto &mitem : matchs) {
        stageMatch(mitem.second);
        cout << "分段匹配结束|index:" << mitem.first << "|count:" << mitem.second.size() << std::endl;
    }
}

map<int64_t, int64_t> oasis_match::calcMmrs() {
    map<int64_t, int64_t> mmrs;
    auto danRate = OasisWar_Match_Dan;
    auto powerRate = OasisWar_Match_Power;
    auto winRate = OasisWar_Match_Win;
    auto loseRate = OasisWar_Match_Lose;
    auto maxWinLoseMmr = OasisWar_Match_MaxWinLose;
    powerRate = powerRate == 0 ? 10000.0 : powerRate;
    for (const auto &legion : data.legions) {
        auto mmrDan = legion.second.danScore * danRate;
        int64_t mmrPower = 1.0 * legion.second.power / powerRate;
        auto mmrWin = legion.second.winStreak * winRate;
        auto mmrLose = legion.second.loseStreak * loseRate;
        mmrWin = mmrWin > maxWinLoseMmr ? maxWinLoseMmr : mmrWin;
        mmrLose = mmrLose > maxWinLoseMmr ? maxWinLoseMmr : mmrLose;
        mmrs[legion.first] = mmrDan + mmrPower + mmrWin - mmrLose;
        cout << "mmrs|军团:" << legion.first << "|段位分:" << mmrDan << "|战力分:" << mmrPower << "|胜利分:" << mmrWin
                            << "|失败分:" << mmrLose << "|段位:" << legion.second.danId << "|战力:" << legion.second.power
                            << "|胜场:" << legion.second.winStreak << "|败场:" << legion.second.loseStreak
                            << "|最终mmr分:" << mmrs[legion.first] << std::endl;
    }
    return mmrs;
}

void oasis_match::stageMatch(vector<pair<int64_t, int64_t>> &mmrs) {
    if ((int64_t) mmrs.size() <= 1) {
        cout << "阶段军团小于1个，不匹配" << std::endl;
        return;
    }
    std::sort(mmrs.begin(), mmrs.end(),
              [](const pair<int64_t, int64_t> &left, const pair<int64_t, int64_t> &right) {
                  if (left.second != right.second) {
                      return left.second > right.second;
                  }
                  return left.first > right.first;
    });
    set<int64_t> used;
    for (auto iter = mmrs.begin(); iter != mmrs.end(); ++iter) {
        if (used.find(iter->first) != used.end()) {
            continue;
        }
        auto red = iter->first;
        used.insert(red);

        auto blue = findEnemy(red, used, mmrs);
        if (blue) {
            used.insert(blue);
        }
        // 设置对手
        setMatchResult(red, blue);
    }
}

int64_t oasis_match::findEnemy(int64_t redUid, const set<int64_t> &used,
                               const vector<pair<int64_t, int64_t>> &mmrs) {
    auto legionRed = getLegionObject(redUid);
    if (nullptr == legionRed) {
        return 0;
    }
    vector<int64_t> noInsUids;
    for (const auto &mmr : mmrs) {
        if (used.find(mmr.first) != used.end()) {
            continue;
        }
        auto legionBlue = getLegionObject(mmr.first);
        if (nullptr == legionBlue) {
            continue;
        }
        if (legionRed->luid == legionBlue->luid) {
            continue;
        }
        if (legionRed->server == legionBlue->server) {
            noInsUids.push_back(mmr.first);
            continue;
        }
        if (legionRed->lastMatchUid == mmr.first) {
            noInsUids.push_back(mmr.first);
            continue;
        }
        return mmr.first;
    }
    if (!noInsUids.empty()) {
        cout << "无有效对手填充|red:" << redUid << "|blue:" << noInsUids.at(0) << endl;
        return noInsUids.at(0);
    }
    return 0;
}

void oasis_match::setMatchResult(int64_t red, int64_t blue) {
    auto legRed = getLegionObject(red);
    auto legBlue = getLegionObject(blue);
    if (nullptr == legRed || nullptr == legBlue) {
        cout << "设置匹配结果军团不存在|red:" << red << "|blue:" << blue << endl;
        return;
    }
    legRed->opEnmy = blue;
    legBlue->opEnmy = red;
    legRed->lastMatchUid = blue;
    legBlue->lastMatchUid = red;
    cout << "匹配|红方:" << red << "|区服:" << legRed->server << "|联盟:" << legRed->luid << endl;
    cout << "匹配|蓝方:" << blue << "|区服:" << legBlue->server << "|联盟:" << legBlue->luid << endl;
    cout << "-------------------------------------------------------------------------------------" << endl;
}

struct OwActLegionInfo *oasis_match::getLegionObject(int64_t uid) {
    auto iter = data.legions.find(uid);
    return iter == data.legions.end() ? nullptr : &iter->second;
}

int main() {
    oasis_match::loadConfig();
    oasis_match::startMatch();
}